/****************************************************************** 
File name: UFO.c
Date: 2015/7/19
Description: 获取和设定飞碟参数的函数	 
*******************************************************************/
#include "hitword.h"
 
/************************************************************************/
/*函数原型：int UFOPosX()												*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：UFO的X坐标							   						*/                                                                   
/*函数功能：获取飞碟在屏幕上的X坐标										*/                                                                   
/************************************************************************/
int UFOPosX(){ 

	return theApp.ufo.rect.x;
}

/************************************************************************/
/*函数原型：int UFOPosY()												*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：UFO的Y坐标							   						*/                                                                   
/*函数功能：获取飞碟在屏幕上的Y坐标										*/                                                                   
/************************************************************************/
int UFOPosY(){ 

	return theApp.ufo.rect.y;
}

/************************************************************************/
/*函数原型：int UFOWidth()												*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：UFO飞碟纹理宽度					   							*/                                                                   
/*函数功能：获取UFO飞碟纹理的宽度										*/                                                                   
/************************************************************************/
int UFOWidth(){ 

	return theApp.ufo.gufo.mWidth;
}

/************************************************************************/
/*函数原型：int UFOHeight()												*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：UFO飞碟纹理高度					   							*/                                                                   
/*函数功能：获取UFO飞碟纹理的高度										*/                                                                   
/************************************************************************/
int UFOHeight(){ 

	return theApp.ufo.gufo.mHeight;
}
 
/************************************************************************/
/*函数原型：int UFOHP()													*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：UFO实际生命值						   						*/                                                                   
/*函数功能：获取UFO实际生命值											*/                                                                   
/************************************************************************/
int UFOHP(){ 

	return theApp.blood.hp;
}

/************************************************************************/
/*函数原型：int UFOScreenHP()											*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：UFO实际生命值						   						*/                                                                   
/*函数功能：获取UFO当前显示生命值										*/                                                                   
/************************************************************************/
int UFOScreenHP(){ 

	return theApp.blood.screen_hp;
}

/************************************************************************/
/*函数原型：int HPWidth()												*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：生命条纹理宽度					   							*/                                                                   
/*函数功能：获取生命条纹理的宽度										*/                                                                   
/************************************************************************/
int HPWidth(){ 

	return theApp.blood.gblood.mWidth;
}

/************************************************************************/
/*函数原型：int HPHeight()												*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：生命条纹理高度					   							*/                                                                   
/*函数功能：获取生命条纹理的高度										*/                                                                   
/************************************************************************/
int HPHeight(){ 

	return theApp.blood.gblood.mHeight;
}