#include "Russia.h"


/************************************************************************/
/*函数原型：int ScoreWidth()											*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：得分纹理的宽度			   									*/                                                                   
/*函数功能：获取得分纹理的宽度											*/                                                                   
/************************************************************************/
int ScoreWidth(){ 

	return theApp.Score.ltexture.mWidth;
}

/************************************************************************/
/*函数原型：int ScoreHeight()											*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：得分纹理的高度			   									*/                                                                   
/*函数功能：获取得分纹理的高度											*/                                                                   
/************************************************************************/
int ScoreHeight(){ 

	return theApp.Score.ltexture.mHeight;
}

/************************************************************************/
/*函数原型：BOOL IsScoreUp()											*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：无						   									*/                                                                   
/*函数功能：判断当前得分是否到达现难度得分上限							*/                                                                   
/************************************************************************/
BOOL IsScoreUp(){

	static int LevelUpScore=2000;

	if (theApp.Score.data>=LevelUpScore)
	{
		LevelUpScore+=theApp.Level.data*2000; 
		return TRUE;
	}
	return FALSE;

}

/************************************************************************/
/*函数原型：int getLevel()												*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：当前游戏难度													*/
/*函数功能：获取当前游戏难度											*/                                                                   
/************************************************************************/
int getLevel(){ 
	return theApp.Level.data;
}

/************************************************************************/
/*函数原型：int LevelWidth()											*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：等级纹理的宽度			   									*/                                                                   
/*函数功能：获取等级纹理的宽度											*/                                                                   
/************************************************************************/
int LevelWidth(){
	return theApp.Level.ltexture.mWidth;
}

/************************************************************************/
/*函数原型：int LevelHeight()											*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：等级纹理的高度			   									*/                                                                   
/*函数功能：获取等级纹理的高度											*/                                                                   
/************************************************************************/
int LevelHeight(){

	return theApp.Level.ltexture.mHeight;
}

/************************************************************************/
/*函数原型：int ButtonWidth()											*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：按钮宽度					   									*/                                                                   
/*函数功能：计算游戏中按钮的宽度（本实例中所有按钮宽度一致）			*/                                                                   
/************************************************************************/
int ButtonWidth(){

	return theApp.StartBtn.ltexture.mWidth;
}

/************************************************************************/
/*函数原型：int ButtonWidth()											*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：按钮高度					   									*/                                                                   
/*函数功能：计算游戏中按钮的高度（本实例中所有按钮高度一致）			*/                                                                   
/************************************************************************/
int ButtonHeight(){

	return theApp.StartBtn.ltexture.mHeight/theApp.nStartBtnSprite;
}

/************************************************************************/
/*函数原型：void updateLevel()											*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：无															*/                                                                   
/*函数功能：更新难度等级纹理			 								*/                                                                   
/************************************************************************/
void updateLevel(){

	SDL_DestroyTexture(theApp.Level.ltexture.mTexture); 
	theApp.Level.ltexture=load_Number(theApp.Level.data);
	MakeRect(&theApp.Level.rect,520,40,LevelWidth(),LevelHeight());   
}

/************************************************************************/
/*函数原型：void incLevel()												*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：无															*/                                                                   
/*函数功能：难度等级加一				 								*/                                                                   
/************************************************************************/
void incLevel(){ 

	theApp.Level.data++;
	updateLevel();
}

/************************************************************************/
/*函数原型：void resetLevel()											*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：无															*/                                                                   
/*函数功能：重置难度等级为一				 							*/                                                                   
/************************************************************************/
void resetLevel(){ 

	theApp.Level.data=1;
	updateLevel();
}

/************************************************************************/
/*函数原型：void updateScore()											*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：无															*/                                                                   
/*函数功能：更新得分纹理			 								*/                                                                   
/************************************************************************/
void updateScore(){

	SDL_DestroyTexture(theApp.Score.ltexture.mTexture);  
	theApp.Score.ltexture=load_Number(theApp.Score.data);
	MakeRect(&theApp.Score.rect,520,110,ScoreWidth(),ScoreHeight()); 
}
 
/************************************************************************/
/*函数原型：void incScore(int increment)								*/                                                                   
/*传入参数：分数的增加量												*/                                                                   
/*返 回 值：无															*/                                                                   
/*函数功能：修改得分数值				 								*/                                                                   
/************************************************************************/
void incScore(int increment){

	theApp.Score.data+=increment;
	updateScore(); 
}

/************************************************************************/
/*函数原型：void resetScore()											*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：无															*/                                                                   
/*函数功能：重置得分数值	 											*/                                                                   
/************************************************************************/
void resetScore(){

	theApp.Score.data+=0;
	updateScore(); 
}

/************************************************************************/
/*函数原型：void* getConStrolAt(int x,int y)							*/                                                                   
/*传入参数：X坐标，Y坐标												*/                                                                   
/*返 回 值：坐标在某个按钮内，返回该按钮的地址，否则返回空指针			*/                                                                   
/*函数功能：获取坐标所处按钮的指针	 									*/                                                                   
/************************************************************************/ 
void* getControlAt(int x,int y){ 
	if (HitRectTest(x,y,theApp.StartBtn.rect))
		return &theApp.StartBtn;
	if (HitRectTest(x,y,theApp.StopBtn.rect))
		return &theApp.StopBtn;
	if (HitRectTest(x,y,theApp.QuitBtn.rect))
		return &theApp.QuitBtn;
	return NULL;
}