#include "Russia.h"
  
/************************************************************************/
/*函数原型：void resetShape(Shape *shape) 								*/                                                                   
/*传入参数：待重置的Shape												*/                                                                   
/*返 回 值：无															*/
/*函数功能：重置Shape的速度，位置等参数									*/                                                                   
/************************************************************************/
void resetShape(){
	 
	srand(SDL_GetTicks()); 	  
	theApp.shape.nCurrent_block_index=rand()%19;     
	theApp.shape.nNext_block_index=rand()%19;  
	theApp.shape.bAccel=FALSE;
	theApp.shape.X=6;
	theApp.shape.Y=1; 

}

/************************************************************************/
/*函数原型：void nextShape() 											*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：无															*/
/*函数功能：将下落图形设为下一个形状，并设置起始位置					*/                                                                   
/************************************************************************/
void nextShape(){ 

	theApp.shape.nCurrent_block_index=theApp.shape.nNext_block_index;     
	theApp.shape.nNext_block_index=rand()%19;  
	theApp.shape.X=6;
	theApp.shape.Y=1; 

}

/************************************************************************/
/*函数原型：void setAccel(BOOL accel) 									*/                                                                   
/*传入参数：是否加速													*/                                                                   
/*返 回 值：无															*/
/*函数功能：设定下落方块是否加速										*/                                                                   
/************************************************************************/
void setAccel(BOOL accel){

	theApp.shape.bAccel=accel;
}

/************************************************************************/
/*函数原型：BOOL IsAccel()												*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：是否加速													*/
/*函数功能：判断下落方块是否加速										*/                                                                   
/************************************************************************/
BOOL IsAccel(){

	return theApp.shape.bAccel;
}
 
/************************************************************************/
/*函数原型：BOOL getShapeX()											*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：下落图形的X坐标												*/
/*函数功能：获取下落图形的X坐标											*/                                                                   
/************************************************************************/
int getShapeX(){

	return theApp.shape.X;
}

/************************************************************************/
/*函数原型：void alterShapeX(int increment)								*/                                                                   
/*传入参数：X坐标的改变量												*/                                                                   
/*返 回 值：无															*/
/*函数功能：修改下落图形的X坐标											*/                                                                   
/************************************************************************/
void alterShapeX(int increment){

	theApp.shape.X+=increment;
}

/************************************************************************/
/*函数原型：BOOL getShapeY()											*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：下落图形的Y坐标												*/
/*函数功能：获取下落图形的Y坐标											*/                                                                   
/************************************************************************/
int getShapeY(){

	return theApp.shape.Y;
}

/************************************************************************/
/*函数原型：void alterShapeY(int increment)								*/                                                                   
/*传入参数：Y坐标的改变量												*/                                                                   
/*返 回 值：无															*/
/*函数功能：修改下落图形的Y坐标											*/                                                                   
/************************************************************************/
void alterShapeY(int increment){

	theApp.shape.Y+=increment;
}

/************************************************************************/
/*函数原型：int getCurrentBlockID()										*/                                                                   
/*传入参数：无															*/                                                                   
/*返 回 值：当前图形的BlockId												*/
/*函数功能：获取当前图形的BlockId										*/                                                                   
/************************************************************************/
int getCurrentBlockID(){

	return theApp.shape.nCurrent_block_index;
}

/************************************************************************/
/*函数原型：void setCurrentBlockID(int blockindex) 						*/                                                                   
/*传入参数：BlockId														*/                                                                   
/*返 回 值：无															*/
/*函数功能：设置当前图形的形状											*/                                                                   
/************************************************************************/
void setCurrentBlockID(int blockindex){
  
	theApp.shape.nCurrent_block_index=blockindex;
}